app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("email", "full_name", "location", "password", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def update
		user_find
		if @user.update(user_params)
---
UPDATE "users" SET "full_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["full_name", "Allan Camargo"], ["updated_at", "2016-03-30 02:39:47.167384"], ["id", 3]]